<script lang="ts">
	import backgroundImage from '$lib/images/back.jpg';
</script>

<svelte:head>
	<title>Сервис для заполнения карточек обследования пунктов ГГС</title>
	<meta name="description" content="Сервис для заполнения карточек обследования пунктов ГГС" />
</svelte:head>

<div
	class="aspect-[8/3] w-screen bg-cover bg-center p-4"
	style="background-image: url({backgroundImage})"
>
	<h1 class="font-bold text-white">Государственная геодезическая сеть</h1>
	<div class="flex h-full items-end justify-center">
		<a href="/survey" class="btn variant-filled-surface h-min" type="submit"
			>Перейти к заполнению карточки обследования</a
		>
	</div>
</div>
<main class="container mx-auto mt-0 space-y-10 px-4 py-10 md:max-w-5xl">
	<div>
		<p>
			Государственная геодезическая сеть (ГГС) закрепляет на земной поверхности различные реализации
			государственной и местной систем координат. Системы координат нужны для ориентирования в
			пространстве, создания карт и планов, геоинформационных систем, навигации и решения множества
			других задач. Каждый пункт ГГС имеет специальную метку-марку (геодезический центр), координаты
			центра которой определены с высокой точностью. Задача геодезического пункта - зафиксировать
			эти координаты относительно земной поверхности и обеспечить их беспрепятственное использование
			при выполнении специальных (геодезических) работ с целью определения пространственного
			положения стационарных и/или движущихся объектов, находящихся в пределах нашей страны.
		</p>
		<p>
			Значительная часть пунктов ГГС была построена в XX веке и служила для реализации нескольких
			видов геодезических измерений - угловых (при помощи специальных приборов-теодолитов измерялись
			горизонтальные и вертикальные углы между направлениями на геодезические пункты), линейных (при
			помощи свето- и радиодальномеров измерялись расстояния между пунктами) и высотных (при помощи
			специальных приборов - нивелиров измерялись разности высот между пунктами). Для лучшей
			видимости многие геодезические пункты размещаются на возвышенностях - вершинах гор, холмов,
			зданиях и оснащались наружными знаками (сигналами), построенными из дерева, железа,
			железобетона, каменными или кирпичными турами. Для наблюдений с больших расстояний на вершине
			установлен визирный цилиндр. Инструмент наблюдателя устанавливается на штативе (треноге) или
			на специально изготовленном из дерева/металла/камня столике над геодезическим центром пункта.
			Вершина сигнала также центрируется над геодезическим центром. Для большей сохранности
			геодезический центр (монолит) - более или менее сложная конструкция из металла и бетона
			надежно закрепленная в грунте и несущий в своей верхней части закоординированную марку, может
			состоять из нескольких частей, соосно установленных одна над другой. Если верхняя часть центра
			будет утрачена, нижележащий центр пункта все равно может использоваться для наблюдений. Часто
			верхней геодезический центр засыпается грунтом или закладывается камнями для большей его
			сохранности. Рядом с геодезическим центром к северу от него устанавливается специальный
			бетонный столбик с табличкой обращенной к центру. Ряд геодезических пунктов имеют в своем
			составе пару вспомогательных (ориентирных) пунктов (ОП), расположенных на расстояниях 250-1000
			метров. Для лучшего отыскания центра пункта его окапывают квадратной канавкой глубиной около
			0,5 м (окопка) и хорошо сохраняющейся на местности в течение длительного времени.
		</p>
		<p>
			Задача обследования геодезических пунктов крайне важна для поддержания целостности
			координатной основы Российской Федерации. Многие пункты находятся в труднодоступных местах,
			ряд пунктов наоборот расположены в зоне интенсивной хозяйственной деятельности. И в том и в
			другом случае часть пунктов частично или полностью утрачивается или перестает быть пригодной
			для выполнения геодезических работ. Специалистам необходимо иметь достаточно полную и
			актуальную информацию о каждом пункте ГГС для того, чтобы иметь возможность использовать его в
			своей работе. Учитывая, что всего на территории России расположено несколько сотен тысяч (!)
			геодезических пунктов и их роль в решении различных производственных, военных и научных задач
			чрезвычайно высока, проблема скорейшего обследования ГГС имеет важнейшее государственное
			значение!
		</p>
		<p>Внесите свой вклад в решение этой задачи!</p>
	</div>
</main>
